src_ext/Documents/УЗ_Урок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_Урок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Расходы</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ДополнительныеРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПедагога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДопРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленоПедагогу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДомашнееЗадание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаУрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ученики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СписатьОплату</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Явка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заметка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонусов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленияПедагогу</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИзменять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/AccumulationRegisters/УЗ_ДвижениеДисконтныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_ДвижениеДисконтныхКарт</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_ext/Documents/УЗ_НачисленияПедагогам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_НачисленияПедагогам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НачисленияПедагогам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/Catalogs/УЗ_ДисконтныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_ДисконтныеКарты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодКартыШтрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеДействует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/Documents/УЗ_Урок/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ЗаписьУрокаПодтверждена;

#Область ОбработчикиСобытийФормы

Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УЗ_ДатыЗапрета.ФормаПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//новый урок — на текущее время, а не на полночь; время из календаря/помощника не трогаем
	Если Объект.Ссылка.Пустая() Тогда
		//черновик из календаря: время, помещение, группа/педагог со ставкой, предмет, тариф — ЗначенияЗаполнения.
		//У реквизитов урока «Заполнять из данных заполнения» выключено (платформа их не заполняет), поэтому — здесь,
		//поимённо, до расчёта длительности «Ч:ММ» ниже
		ЗначенияЗаполнения = Неопределено;
		Если Параметры.Свойство("ЗначенияЗаполнения", ЗначенияЗаполнения)
			И ТипЗнч(ЗначенияЗаполнения) = Тип("Структура") Тогда
			Для Каждого Имя Из СтрРазделить(
				"ГруппаОбучения,Педагог,СтавкаПедагога,ПредметОбучения,Тариф,Помещение,КоличествоЧасов", ",") Цикл
				Если ЗначенияЗаполнения.Свойство(Имя) И ЗначениеЗаполнено(ЗначенияЗаполнения[Имя]) Тогда
					Объект[Имя] = ЗначенияЗаполнения[Имя];
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если Параметры.Свойство("Дата") И ЗначениеЗаполнено(Параметры.Дата) Тогда
			Объект.Дата = Параметры.Дата;
		ИначеЕсли Объект.Дата = НачалоДня(Объект.Дата) Тогда
			Сейчас = НачалоМинуты(ТекущаяДатаСеанса());
			Объект.Дата = НачалоДня(?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, Сейчас))
				+ (Сейчас - НачалоДня(Сейчас));
		КонецЕсли;
	КонецЕсли;

	//дата запрета: «только просмотр» ставит ПриЧтенииНаСервере (УЗ_ДатыЗапрета)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации";
	Если Запрос.Выполнить().Пустой() Тогда
		Элементы.Организация.Видимость = Ложь;
	КонецЕсли;

	//ставка и начисления педагогу — только руководителю; у менеджера страница скрыта (начисление по ставке
	//считает проведение урока, в уроке оно не хранится — R24)
	ДоступнаЗарплата = УЗ_Общий.ДоступнаЗарплата();
	Элементы.СтавкаПедагога.Видимость = ДоступнаЗарплата;
	Элементы.ГруппаНачисленияПедагогу.Видимость = ДоступнаЗарплата;
	ПересчитатьНачисленияПедагога();

	//длительность на экране — «Ч:ММ» (реквизит формы), в объекте — число часов
	Длительность = УЗ_ОбщийКлиентСервер.ВремяИзЧасов(Объект.КоличествоЧасов);
	Если Объект.Ссылка.Пустая() И Не ЗначениеЗаполнено(Объект.Окончание) И Объект.КоличествоЧасов > 0 Тогда
		Объект.Окончание = Объект.Дата + Окр(Объект.КоличествоЧасов * 60) * 60; //«до» у черновика из календаря
	КонецЕсли;
	//остаток по предмету: плюс — цветом плюса со знаком, минус — цветом минуса, ноль — пусто
	УЗ_Общий.ОформитьОстатокДенег(УсловноеОформление, "УченикиЗадолженностьПоПредмету",
		"Объект.Ученики.ЗадолженностьПоПредмету");
	ОбновитьЗаголовокУчеников();
	ОбновитьКолонкиАбонементов();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Длительность = УЗ_ОбщийКлиентСервер.ВремяИзЧасов(Объект.КоличествоЧасов);
	ПересчитатьНачисленияПедагога();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ЗакрытьФормуУрока");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	//будущий урок «Провести» не проводит, а записывает планом — как в типовых (факт услуги
	//фиксируется после занятия); запрет на сервере остаётся для обработок и обменов (В10)
	//решение «план или факт» — по часам сервера (сеанса), а не компьютера пользователя (Codex Т2)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И УрокЕщеНеНачался(Объект.Дата) Тогда
		//проведённый урок, перенесённый в будущее, — снять проведение: простая запись оставила бы
		//прошлые движения (списание ученика, зарплату педагога) на старой дате
		ПараметрыЗаписи.РежимЗаписи = ?(Объект.Проведен, РежимЗаписиДокумента.ОтменаПроведения,
			РежимЗаписиДокумента.Запись);
		//пояснение — после записи: показанное здесь перекрывало стандартное оповещение «Изменение»
		ПараметрыЗаписи.Вставить("ЗаписанКакПлан", Истина);
	КонецЕсли;

	Если ЗаписьУрокаПодтверждена = Истина Тогда
		ЗаписьУрокаПодтверждена = Ложь;
		Возврат;
	КонецЕсли;
	ТекстПредупреждения = "";

	// Проверка
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение и ЗначениеЗаполнено(Объект.Педагог) Тогда

		НомерБезНулей = Объект.Номер;
		Пока Найти(НомерБезНулей,"0") = 1 Цикл
			НомерБезНулей = Сред(НомерБезНулей,2); //удаляет лидирующие нули
		КонецЦикла;

		ИтогПроверки = ПроверитьДокументПоГрафикуРабочегоВремени();

		Если ИтогПроверки <> Неопределено Тогда

			ТекстОповещения = "Урок № "+НомерБезНулей+ " от " +Формат(Объект.Дата,"ДФ=dd.MM.yyyy")+ " с "
				+Формат(Объект.Дата,"ДФ=HH:mm")+
			" по " +Формат(Объект.Дата + Окр(Объект.КоличествоЧасов * 60) * 60,"ДФ=HH:mm")
				+ " не входит в график учета рабочего времени педагога "
			+ИтогПроверки.Педагог+ " (" +Формат(ИтогПроверки.Дата,"ДФ='ММММ гггг ""г"".'")+ ") !!!";

			ТекстПредупреждения = ТекстОповещения;

		КонецЕсли;

		//пересечение по педагогу/помещению не спрашиваем: проведение отказывает само, сообщение — у поля
		//(Документы.УЗ_Урок.ПроверкаПересечений)

	КонецЕсли;

	Если Не ПустаяСтрока(ТекстПредупреждения) Тогда
		Отказ = Истина;
		ПараметрыОповещения = Новый Структура("ПараметрыЗаписи", ПараметрыЗаписи);
		Оповещение = Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект, ПараметрыОповещения);
		ПоказатьВопрос(Оповещение, ТекстПредупреждения + Символы.ПС + "Продолжить запись урока?",
			РежимДиалогаВопрос.ДаНет, 0);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбновитьВидимостьРасходы();
	ОбновитьВидимость();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДвиженияДокумента(Команда)
	ДанныеС = Новый Структура;
	ДанныеС.Вставить("Документ",Объект.Ссылка);
	ОткрытьФорму("Отчет.УЗ_ДвиженияДокумента.Форма.ДвиженияДокумента",ДанныеС ,ЭтаФорма, , , , ,
		РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РассчитатьЗадолженность(Ученик, ПредметОбучения)

	Если Не ЗначениеЗаполнено(Ученик) или Не ЗначениеЗаполнено(ПредметОбучения) Тогда
		Возврат 0;
	КонецЕсли;

	//В12: остаток денег ученика по предмету — в организации урока (деньги учеников раздельно по организациям)
	Возврат УЗ_Сервер.ОстатокДенегУченика(Ученик, Объект.Организация, ПредметОбучения);

КонецФункции

Функция ОткрытьВзаиморасчетыНаСервере(Ученик)

	Возврат УЗ_Общий.ПараметрыОткрытияОтчета("УЗ_Взаиморасчеты", Новый Структура("Клиент, ПредметОбучения", Ученик,
		Объект.ПредметОбучения));
КонецФункции

//Вкладка «Ученики (5)» — сколько записано на урок.
&НаСервере
Процедура ОбновитьЗаголовокУчеников()
	Количество = Объект.Ученики.Количество();
	Элементы.ГруппаУченикиСтраница.Заголовок = ?(Количество = 0, "Ученики", СтрШаблон("Ученики (%1)", Количество));
КонецПроцедуры

//Колонки «Абонемент» и «Остаток абонемента» — только если хоть у одной строки есть абонемент: у разовых
//учеников они пустые и только занимают место.
&НаСервере
Процедура ОбновитьКолонкиАбонементов()
	ЕстьАбонементы = Ложь;
	Для Каждого Стр Из Объект.Ученики Цикл
		Если ЗначениеЗаполнено(Стр.Абонемент) Тогда
			ЕстьАбонементы = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Элементы.УченикиАбонемент.Видимость = ЕстьАбонементы;
	Элементы.УченикиОстатокАбонемента.Видимость = ЕстьАбонементы;
КонецПроцедуры

Функция ПроверитьДокументПоГрафикуРабочегоВремени()
	Возврат Документы.УЗ_Урок.ПроверитьДокументПоГрафикуРабочегоВремени(Объект);
КонецФункции

Процедура ПересчитатьТабличнуюЧасть()

	Документы.УЗ_Урок.РассчитатьТабличнуюЧасть(Объект);

	Объект.Сумма 		= Объект.Ученики.Итог("Сумма");
	Объект.СуммаСкидки 	= Объект.Ученики.Итог("СуммаСкидки");

	Объект.Окончание = Объект.Дата + Окр(Объект.КоличествоЧасов * 60) * 60;
	Длительность = УЗ_ОбщийКлиентСервер.ВремяИзЧасов(Объект.КоличествоЧасов);
	ОбновитьЗаголовокУчеников();

КонецПроцедуры

//Начало урока ещё не наступило — по ТекущаяДатаСеанса, как проверка проведения в модуле объекта (В10).
&НаСервереБезКонтекста
Функция УрокЕщеНеНачался(Знач ДатаУрока)
	Возврат ДатаУрока > ТекущаяДатаСеанса();
КонецФункции

&НаКлиенте
Процедура ПередЗаписьюЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаписьУрокаПодтверждена = Истина;
		Записать(ДополнительныеПараметры.ПараметрыЗаписи);
	КонецЕсли;

КонецПроцедуры

Процедура ОбновитьВидимость()

	Для Каждого Стр из Объект.Ученики Цикл
		Стр.ЗадолженностьПоПредмету = РассчитатьЗадолженность(Стр.Ученик, Объект.ПредметОбучения);
	КонецЦикла;
	ОбновитьОстаткиБонусов();
	ОбновитьОстаткиАбонементов();
	ОбновитьЗаголовокУчеников();

	ПоказатьКартинки();

КонецПроцедуры

Процедура ПоказатьКартинки()

	КартинкаПредметаОбучения = ?(ЗначениеЗаполнено(Объект.ПредметОбучения),
		УЗ_Общий.АдресФото(Объект.ПредметОбучения.Фото), "");

КонецПроцедуры

#Область Ученики

&НаКлиенте
Процедура Подбор(Команда)

	УЗ_ОбщийКлиент.ПодобратьУчеников(ЭтотОбъект, Новый ОписаниеОповещения("ПодборУчениковЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ПодборУчениковЗавершение(Результат,Параметры) Экспорт
	Если Результат <> Неопределено Тогда
		ДобавитьВыбранных(Результат);
		ПересчитатьТабличнуюЧасть();
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьВыбранных(Выбранные)

	//из подбора приходит массив, из обычного выбора — одна ссылка (раньше она молча терялась в Попытке)
	Если ТипЗнч(Выбранные) = Тип("Массив") Тогда
		Список = Выбранные;
	Иначе
		Список = Новый Массив;
		Список.Добавить(Выбранные);
	КонецЕсли;
	//строка ученика заполняется как при выборе ученика в строке: тариф (из карточки или тариф урока), скидка,
	//дисконтная карта (прежде тариф оставался пустым — строка «К оплате» проводилась бы бесплатно)
	Карты = ДисконтныеКартыУчеников(Список);
	Для Каждого Стр из Список Цикл
		НовСтр = Объект.Ученики.Добавить();
		НовСтр.Ученик 			= Стр;
		НовСтр.Тариф 			= ВернутьТариф(Стр);
		НовСтр.Скидка 			= ВернутьСкидку(Стр);
		НовСтр.ДисконтнаяКарта =
			?(Карты[Стр] = Неопределено, Справочники.УЗ_ДисконтныеКарты.ПустаяСсылка(), Карты[Стр]);
	КонецЦикла;
	ПодставитьАбонементы();

КонецПроцедуры

//Абонемент строк — на дату урока, единой функцией (Справочники.УЗ_Абонемент.ПодставитьАбонементы): при выборе и
//подборе ученика, смене даты, предмета, группы, организации. Абонемент строки, который действует и которого
//хватает, остаётся; исчерпан или приостановлен — строка по тарифу с предупреждением (В16).
Процедура ПодставитьАбонементы()

	Для Каждого Предупреждение Из Справочники.УЗ_Абонемент.ПодставитьАбонементы(Объект) Цикл
		УЗ_ОбщийКлиентСервер.СообщитьПользователю(Предупреждение);
	КонецЦикла;
	ОбновитьОстаткиАбонементов();

КонецПроцедуры

//Остаток абонемента строки — тем же текстом, что в карточке абонемента, помощнике и панели ученика.
Процедура ОбновитьОстаткиАбонементов()

	Для Каждого Стр Из Объект.Ученики Цикл
		Стр.ОстатокАбонемента = Справочники.УЗ_Абонемент.ТекстОстатка(Стр.Абонемент);
	КонецЦикла;
	ОбновитьКолонкиАбонементов();

КонецПроцедуры

&НаКлиенте
Процедура УченикиАбонементПриИзменении(Элемент)
	ОбновитьОстаткиАбонементов();
	ПересчитатьТабличнуюЧасть();
КонецПроцедуры

&НаКлиенте
Процедура УченикиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ДобавитьВыбранных(ВыбранноеЗначение);

	ПересчитатьТабличнуюЧасть();

КонецПроцедуры

&НаКлиенте
Процедура УченикиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекДанные = Элементы.Ученики.ТекущиеДанные;

	Если Поле.Имя = "УченикиЗадолженностьПоПредмету" Тогда
		ПараметрыОткрытия = ОткрытьВзаиморасчетыНаСервере(ТекДанные.Ученик);
		ОткрытьФорму("Отчет.УЗ_Взаиморасчеты.Форма", ПараметрыОткрытия, ЭтаФорма);
	ИначеЕсли Поле.Имя = "Ученики1ОстатокБонусов" Тогда
		ОткрытьФорму("Отчет.УЗ_ОтчетПоДисконтнымКартам.Форма", , ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УченикиУченикСоздание(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ПараметрыСтроки = Новый Структура;

	Назв = СокрЛП(Элемент.ТекстРедактирования);

	Если Найти(Назв," ") > 0 Тогда
		Симв1 = Найти(Назв," ");
		ПараметрыСтроки.Вставить("Наименование",Лев(Назв,Симв1-1));
		Назв = СокрЛП(Сред(Назв,Симв1+1));
	Иначе
		ПараметрыСтроки.Вставить("Наименование",Назв);
		Назв = "";
	КонецЕсли;

	ПараметрыСтроки.Вставить("Группа","Ученики");

	Пар = Новый Структура("Ключ2", ПараметрыСтроки);

	ОткрытьФорму("Справочник.УЗ_ФизЛица.Форма.ФормаЭлемента",Пар,ЭтотОбъект,ЭтаФорма.УникальныйИдентификатор,
		ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура УченикиУченикПриИзменении(Элемент)

	ТекДанные = Элементы.Ученики.ТекущиеДанные;

	ТекДанные.ДисконтнаяКарта 	= НайтиДисконтнуюКарту(ТекДанные.Ученик);
	ТекДанные.Скидка 			= ВернутьСкидку(ТекДанные.Ученик);
	ТекДанные.Тариф 			= ВернутьТариф(ТекДанные.Ученик);

	ПодставитьАбонементы();
	ПересчитатьТабличнуюЧасть();

КонецПроцедуры

Функция ВернутьСкидку(Ученик)
	Возврат Ученик.Скидка;
КонецФункции

//В20: тариф ученика, иначе тариф группы, иначе тариф урока — общей функцией (абонемент строки главнее тарифа)
Функция ВернутьТариф(Ученик)

	Возврат Документы.УЗ_Урок.ТарифНовойСтроки(Ученик, Объект.ГруппаОбучения, Объект.Тариф);

КонецФункции

&НаКлиенте
Процедура ПересчитатьЦеныПоТарифу(Команда)

	Для Каждого Стр из Объект.Ученики Цикл
		Стр.ЦенаТарифа = 0;
		Стр.СуммаСкидки = 0;
		Стр.Сумма = 0;
	КонецЦикла;

	ПересчитатьТабличнуюЧасть();

КонецПроцедуры

#КонецОбласти

#Область ПриИзменении
&НаКлиенте
Процедура ГруппаОбученияПриИзменении(Элемент)

	ГруппаОбученияПриИзмененииНаСервере();
	ПересчитатьТабличнуюЧасть();
	ПересчитатьНачисленияПедагога();

КонецПроцедуры

Процедура ГруппаОбученияПриИзмененииНаСервере()

	Если ЗначениеЗаполнено(Объект.ГруппаОбучения) Тогда

		Объект.Педагог 			= Объект.ГруппаОбучения.Педагог;
		//ставка группы, иначе педагога
		Объект.СтавкаПедагога	= Документы.УЗ_Урок.СтавкаПедагогаПоУмолчанию(Объект.Педагог, Объект.ГруппаОбучения);
		Объект.Помещение 		= Объект.ГруппаОбучения.Помещение;
		//В21: длительность — по расписанию группы в день урока, общая «Продолжительность» — если у дня нет времени
		Расписание = Документы.УЗ_Урок.РасписаниеГруппыНаДень(Объект.ГруппаОбучения, Объект.Дата);
		Объект.КоличествоЧасов 	= ?(Расписание = Неопределено,
			(Объект.ГруппаОбучения.Продолжительность - '00010101') / 3600, Расписание.КоличествоЧасов);
		Объект.ПредметОбучения 	= Объект.ГруппаОбучения.ПредметОбучения;

		Если НЕ Объект.ГруппаОбучения.Тариф.Пустая() Тогда
			Объект.Тариф = Объект.ГруппаОбучения.Тариф;
		КонецЕсли;

		ПодставитьАбонементы();

	КонецЕсли;

КонецПроцедуры

//длительность вводится временем «Ч:ММ», в урок пишется числом часов: 1:30 → 1,5; 0:40 → 0,6667
&НаКлиенте
Процедура ДлительностьПриИзменении(Элемент)
	Объект.КоличествоЧасов = УЗ_ОбщийКлиентСервер.ЧасыИзВремени(Длительность);
	ПересчитатьТабличнуюЧасть();
	ПересчитатьНачисленияПедагога();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ПодставитьАбонементы();
	ПересчитатьТабличнуюЧасть();
КонецПроцедуры

&НаКлиенте
Процедура ПредметОбученияПриИзменении(Элемент)
	ПодставитьАбонементы();
	ПересчитатьТабличнуюЧасть();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ПодставитьАбонементы();
	ПересчитатьТабличнуюЧасть();
КонецПроцедуры

&НаКлиенте
Процедура УченикиСписатьОплатуПриИзменении(Элемент)
	ПересчитатьТабличнуюЧасть();
	ПересчитатьНачисленияПедагога();
КонецПроцедуры

//отметка явки меняет начисление педагогу («за занятие», «за час», «с человека») — сразу на экране
&НаКлиенте
Процедура УченикиЯвкаПриИзменении(Элемент)
	ПересчитатьПослеОтметок();
КонецПроцедуры

&НаКлиенте
Процедура УченикиКоэффициентОчистка(Элемент, СтандартнаяОбработка)
	ПересчитатьТабличнуюЧасть();
КонецПроцедуры

&НаКлиенте
Процедура УченикиТарифПриИзменении(Элемент)
	ТекДанные = Элементы.Ученики.ТекущиеДанные;
	ТекДанные.ЦенаТарифа = 0;
	ТекДанные.СуммаСкидки = 0;
	ТекДанные.Сумма = 0;
	ПересчитатьТабличнуюЧасть();
КонецПроцедуры

&НаКлиенте
Процедура ТарифПриИзменении(Элемент)

	Если Объект.Тариф.Пустая() Тогда
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ТарифПриИзмененииЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Изменить тариф у всех учеников?", РежимДиалогаВопрос.ДаНет, 0);

КонецПроцедуры

&НаКлиенте
Процедура ТарифПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда

		Для Каждого Стр из Объект.Ученики Цикл
			Стр.Тариф 		= Объект.Тариф;
			Стр.ЦенаТарифа 	= 0;
			Стр.СуммаСкидки = 0;
			Стр.Сумма 		= 0;
		КонецЦикла;

		ОбновитьВидимость();

		ПересчитатьТабличнуюЧасть();

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Педагог
&НаКлиенте
Процедура ПедагогПриИзменении(Элемент)
	ПедагогПриИзмененииНаСервере();
КонецПроцедуры

//ставка — по умолчанию (группа или педагог), начисление по ставке пересчитывается на экране
Процедура ПедагогПриИзмененииНаСервере()
	Документы.УЗ_Урок.ПриСменеПедагога(Объект);
	ПересчитатьНачисленияПедагога();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаПедагогаПриИзменении(Элемент)
	ПересчитатьНачисленияПедагога();
КонецПроцедуры

//R24: страница «Начисления педагогу» (только руководителю) — начисление по ставке, как его запишет проведение
//(Документы.УЗ_Урок.НачисленияПоСтавке), и доплаты сверх ставки: проведённые документы «Начисление педагогам» на
//основании урока. Урок начисление не хранит — таблица только для просмотра; у менеджера страница скрыта и данные
//не читаются.
&НаСервере
Процедура ПересчитатьНачисленияПедагога()

	НачисленияПедагогу.Очистить();
	Если Не Элементы.ГруппаНачисленияПедагогу.Видимость Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Начисление Из Документы.УЗ_Урок.НачисленияПоСтавке(Объект) Цикл
		Строка = НачисленияПедагогу.Добавить();
		Строка.Документ = Объект.Ссылка;
		Строка.Комментарий = Начисление.Комментарий;
		Строка.СуммаНачисления = Начисление.Сумма;
	КонецЦикла;
	Если Не Объект.Ссылка.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Строки.Ссылка КАК Документ,
		|	Строки.Комментарий КАК Комментарий,
		|	Строки.Сумма КАК СуммаНачисления
		|ИЗ
		|	Документ.УЗ_НачисленияПедагогам.НачисленияПедагогам КАК Строки
		|ГДЕ
		|	Строки.Ссылка.ДокументОснования = &Урок
		|	И Строки.Ссылка.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Строки.Ссылка.Дата,
		|	Строки.НомерСтроки";
		Запрос.УстановитьПараметр("Урок", Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(НачисленияПедагогу.Добавить(), Выборка);
		КонецЦикла;
	КонецЕсли;
	Итого = НачисленияПедагогу.Итог("СуммаНачисления");
	Элементы.ГруппаНачисленияПедагогу.Заголовок = ?(Итого = 0, НСтр("ru = 'Начисления педагогу'"),
		НСтр("ru = 'Педагогу:'") + " " + Формат(Итого, "ЧДЦ=2; ЧН=0,00"));

КонецПроцедуры

//кнопка «Обновить» на странице начислений педагогу
&НаКлиенте
Процедура ПересчитатьНачисления(Команда)
	ПересчитатьНачисленияПедагога();
КонецПроцедуры

//кнопка «Добавить доплату»: документ «Начисление педагогам» на основании урока (педагог, организация, дата урока)
&НаКлиенте
Процедура ДобавитьНачисление(Команда)

	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Сначала запишите урок: доплата вводится на основании урока.'"));
		Возврат;
	КонецЕсли;
	ОткрытьФорму("Документ.УЗ_НачисленияПедагогам.ФормаОбъекта", Новый Структура("Основание", Объект.Ссылка),
		ЭтотОбъект,
		, , , Новый ОписаниеОповещения("ДобавитьНачислениеЗавершение", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНачислениеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ПересчитатьНачисленияПедагога();
КонецПроцедуры

&НаКлиенте
Процедура НачисленияПедагогуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Строка = НачисленияПедагогу.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если Строка <> Неопределено И ЗначениеЗаполнено(Строка.Документ) И Строка.Документ <> Объект.Ссылка Тогда
		ПоказатьЗначение(Новый ОписаниеОповещения("ДобавитьНачислениеЗавершение", ЭтотОбъект), Строка.Документ);
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область Расходы

&НаКлиенте
Процедура РасходыПриИзменении(Элемент)
	ОбновитьВидимостьРасходы();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьРасходы()

	КоличествоРасходов = 0;

	Для Каждого СтрРасход из Объект.Расходы Цикл
		Если ЗначениеЗаполнено(СтрРасход.Сумма) Тогда
			КоличествоРасходов = КоличествоРасходов + 1;
		КонецЕсли;
	КонецЦикла;

	Если КоличествоРасходов>0 Тогда
		Элементы.ГруппаДополнительныеРасходы.Заголовок = "Доп. расходы: "
			+ Формат(Объект.Расходы.Итог("Сумма"), "ЧДЦ=2; ЧН=0,00");
	Иначе
		Элементы.ГруппаДополнительныеРасходы.Заголовок = "Доп. расходы";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Бонусы

&НаКлиенте
Процедура Ученики1ПриИзменении(Элемент)
	ОбновитьВидимостьБонусы();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьБонусы()

	ОбновитьОстаткиБонусов();
	КоличествоДисконтныхКарт = 0;
	Для Каждого Стр из Объект.Ученики Цикл
		Если ЗначениеЗаполнено(Стр.ДисконтнаяКарта) Тогда
			КоличествоДисконтныхКарт	= КоличествоДисконтныхКарт + 1;
		КонецЕсли;
	КонецЦикла;

	Если КоличествоДисконтныхКарт>0 Тогда
		Элементы.ГруппаБонусы.Заголовок = "Бонусы: " + Формат(Объект.Ученики.Итог("СуммаБонусов"), "ЧДЦ=2; ЧН=0,00");
	Иначе
		Элементы.ГруппаБонусы.Заголовок = "Бонусы";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодПриИзменении(Элемент)
	НайтиПоШК();
КонецПроцедуры

Процедура НайтиПоШК()

	Если ЗначениеЗаполнено(Штрихкод) Тогда

		Для Каждого Стр из Объект.Ученики Цикл
			Если Стр.Ученик = Штрихкод.Владелец Тогда
				Стр.ДисконтнаяКарта = Штрихкод;
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НайтиПоШККоманда(Команда)
	НайтиПоШК();
КонецПроцедуры

&НаКлиенте
Процедура Ученики1ДисконтнаяКартаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОтбора = Новый Структура("Владелец", Элементы.Ученики.ТекущиеДанные.Ученик);
	ПараметрыОткрытия = Новый Структура("Отбор", ПараметрыОтбора);
	ОткрытьФорму("Справочник.УЗ_ДисконтныеКарты.ФормаВыбора", ПараметрыОткрытия, Элемент, ЭтаФорма);
КонецПроцедуры

//Остаток бонусов каждой строки учеников (ученик + его дисконтная карта, по всем организациям) — одним запросом
//на всю таблицу (прежде — запрос, а с клиента ещё и вызов сервера, на каждую строку).
&НаСервере
Процедура ОбновитьОстаткиБонусов()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Клиент КАК Клиент,
	|	Остатки.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	СУММА(Остатки.СуммаБонусовОстаток) КАК Остаток
	|ИЗ
	|	РегистрНакопления.УЗ_ДвижениеДисконтныхКарт.Остатки(, ДисконтнаяКарта В (&Карты)) КАК Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Клиент,
	|	Остатки.ДисконтнаяКарта";
	Запрос.УстановитьПараметр("Карты",
		Объект.Ученики.Выгрузить(, "ДисконтнаяКарта").ВыгрузитьКолонку("ДисконтнаяКарта"));
	Остатки = Запрос.Выполнить().Выгрузить();
	Для Каждого Стр Из Объект.Ученики Цикл
		Найдено = Остатки.НайтиСтроки(Новый Структура("Клиент, ДисконтнаяКарта", Стр.Ученик, Стр.ДисконтнаяКарта));
		Стр.ОстатокБонусов = ?(Найдено.Количество() = 0 Или Не ЗначениеЗаполнено(Стр.Ученик)
			Или Не ЗначениеЗаполнено(Стр.ДисконтнаяКарта), 0, Найдено[0].Остаток);
	КонецЦикла;

КонецПроцедуры

//Дисконтные карты учеников, действующие на дату урока: Соответствие Ученик → карта (у ученика ровно одна
//такая карта; нет или несколько — ученика в соответствии нет, как в НайтиДисконтнуюКарту).
&НаСервере
Функция ДисконтныеКартыУчеников(Ученики)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДисконтныеКарты.Владелец КАК Владелец,
	|	МАКСИМУМ(ДисконтныеКарты.Ссылка) КАК Ссылка,
	|	КОЛИЧЕСТВО(ДисконтныеКарты.Ссылка) КАК Карт
	|ИЗ
	|	Справочник.УЗ_ДисконтныеКарты КАК ДисконтныеКарты
	|ГДЕ
	|	ДисконтныеКарты.Владелец В (&Владельцы)
	|	И (ДисконтныеКарты.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ДисконтныеКарты.ДатаОкончанияДействия >= &НачалоДняУрока)
	|	И ДисконтныеКарты.ДатаНачалаДействия <= &ДатаУрока
	|	И НЕ ДисконтныеКарты.НеДействует
	|	И НЕ ДисконтныеКарты.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ДисконтныеКарты.Владелец";
	ДатаУрока = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Владельцы", Ученики);
	Запрос.УстановитьПараметр("НачалоДняУрока", НачалоДня(ДатаУрока));
	Запрос.УстановитьПараметр("ДатаУрока", ДатаУрока);
	Итог = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Карт = 1 Тогда
			Итог.Вставить(Выборка.Владелец, Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	Возврат Итог;

КонецФункции

Функция НайтиДисконтнуюКарту(Ученик)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДисконтныеКарты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УЗ_ДисконтныеКарты КАК ДисконтныеКарты
	|ГДЕ
	|	ДисконтныеКарты.Владелец = &Владелец
	|	И (ДисконтныеКарты.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ДисконтныеКарты.ДатаОкончанияДействия >= &НачалоДняУрока)
	|	И ДисконтныеКарты.ДатаНачалаДействия <= &ДатаУрока
	|	И НЕ ДисконтныеКарты.НеДействует
	|	И ДисконтныеКарты.ПометкаУдаления = ЛОЖЬ";
	//срок — как при проведении (Документы.УЗ_ПриходДенег.ПроверитьСрокДисконтнойКарты): бессрочная карта
	//и карта, действующая по день урока включительно, подходят
	ДатаУрока = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Владелец", Ученик);
	Запрос.УстановитьПараметр("НачалоДняУрока", НачалоДня(ДатаУрока));
	Запрос.УстановитьПараметр("ДатаУрока", ДатаУрока);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Если РезультатЗапроса.Количество()=1 Тогда
		Возврат РезультатЗапроса[0].Ссылка;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

#КонецОбласти

#Область ПрочиеСобытия

&НаКлиенте
Процедура УченикиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	ТекДанные = Элементы.Ученики.ТекущиеДанные;
	Если Копирование Тогда
		ТекДанные.ЗадолженностьПоПредмету = 0;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьВидимость();
	Если ПараметрыЗаписи.Свойство("ЗаписанКакПлан") Тогда
		УЗ_ПоказатьПослеЗаписи(НСтр("ru = 'Урок записан как план'"),
			СтрШаблон(НСтр("ru = 'Урок начинается %1 — провести его можно после занятия.'"),
				Формат(Объект.Дата, "ДФ='dd.MM.yyyy HH:mm'")));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СделатьОплаченными(Команда)

	Для Каждого Стр из Объект.Ученики Цикл
		Стр.СписатьОплату = Истина;
	КонецЦикла;
	ПересчитатьПослеОтметок();

КонецПроцедуры

&НаКлиенте
Процедура СделатьПосещенными(Команда)
	Для Каждого Стр из Объект.Ученики Цикл
		Стр.Явка = Истина;
	КонецЦикла;
	ПересчитатьПослеОтметок();
КонецПроцедуры

//суммы строк и начисления педагогу — сразу на форме, как при отметке одной строки (прежде до записи
//на экране оставались старые суммы)
&НаКлиенте
Процедура ПересчитатьПослеОтметок()
	ПересчитатьТабличнуюЧасть();
	ПересчитатьНачисленияПедагога();
КонецПроцедуры

#КонецОбласти

#КонецОбласти
